#ifndef __ASM_ARCH_D1H_CLOCK_H_
#define __ASM_ARCH_D1H_CLOCK_H_
#include <asm/types.h>


void clock_init(void);
/*
* Description: Macro to fill the gaps within structures
*/
#define CLK__GAP8(start,finish)     u8   u8__##start##_##finish[(finish)-(start)]
#define CLK__GAP16(start,finish)    u16 u16__##start##_##finish[((finish)-(start))/2]
#define CLK__GAP32(start,finish)    u32 u32__##start##_##finish[((finish)-(start))/4]

/* D1H */
#define CLK__nProtCmdVal           0xA5U          /* register protection unlock command */
#define CLK__nProtCmdVal2          0xA5A55A5AU    /* register protection unlock command 2 */
#define CLK__nCLMAMASK             (u8)0x01U   /* mask for clock monitor enable bits */
#define CLK__nPLL0Locked_Msk       0x00000100UL   /* Status bit of PLL 0 lock */
#define CLK__nPLL1Locked_Msk       0x00000200UL   /* Status bit of PLL 1 lock */
#define CLK__nPLL3Locked_Msk       0x00000800UL   /* Status bit of PLL 3 lock */
#define CLK__nPLLSLocked_Msk       0x00001000UL   /* Status bit of PLL S lock */
#define CLK__nPLLEnable            0x1UL          /* PLL output enable */

#define CLK__nCLMADisable          0x0U           /* disable CLMA */
#define CLK__nCLMAEnable           0x1U           /* enable CLMA */

#define CLK__nClmaPcmdOffset       0x10U          /* OFfset to CLMAn control register 0 */
#define CLK__nClmaPsOffset         0x14U          /* OFfset to CLMAn control register 0 */


                                     | (CLK__nMSTP_DU0_Cfg         << 24U)  \
                                     | (CLK__nMSTP_DU1_Cfg         << 23U)  \
                                     | (CLK__nMSTP_DU2_Cfg         << 22U)  \
                                     | (CLK__nMSTP_SCIF0_Cfg       << 21U)  \
                                     | (CLK__nMSTP_SCIF1_Cfg       << 20U)  \
                                     | (CLK__nMSTP_SCIF2_Cfg       << 19U)  \
                                     | (CLK__nMSTP_SCIF3_Cfg       << 18U)  \
                                     | (CLK__nMSTP_HSCIF0_Cfg      << 17U)  \
                                     | (CLK__nMSTP_HSCIF1_Cfg      << 16U)  \
                                     | (CLK__nMSTP_SFMA0_Cfg       << 12U)  \
                                     | (CLK__nMSTP_RSDS_IF_Cfg     << 11U)  \
                                     | (CLK__nMSTP_VOCA0_Cfg       <<  7U)  \
                                     | (CLK__nMSTP_USBFC_Cfg       <<  4U)  \
                                     | (CLK__nMSTP_USBHC_Cfg       <<  3U) | 0x0200E765UL)

/* System module stop control register 8 */
#define CLK__nMSBC_SMSTPCR8_Cfg      ((CLK__nMSTP_ETNB0_Cfg       << 12U)  \
                                     | (CLK__nMSTP_VIN0_Cfg        << 11U)  \
                                     | (CLK__nMSTP_VIN1_Cfg        << 10U)  \
                                     | (CLK__nMSTP_GPU2D_Cfg       <<  7U)  \
                                     | (CLK__nMSTP_MIPI_IF_Cfg     <<  3U)  \
                                     | (CLK__nMSTP_MLBB0_Cfg       <<  2U)  \
                                     | (CLK__nMSTP_IPMMUGP_Cfg     <<  0U) | 0x01F0E300UL)

/* System module stop control register 9 */
#define CLK__nMSBC_SMSTPCR9_Cfg      ((CLK__nMSTP_I2C0_Cfg        << 31U)  \
                                     | (CLK__nMSTP_I2C1_Cfg        << 30U)  \
                                     | (CLK__nMSTP_RS_CANFD_Cfg    << 16U)  \
                                     | (CLK__nMSTP_GPIO0_Cfg       << 12U)  \
                                     | (CLK__nMSTP_GPIO1_Cfg       << 11U)  \
                                     | (CLK__nMSTP_GPIO2_Cfg       << 10U)  \
                                     | (CLK__nMSTP_GPIO3_Cfg       <<  9U)  \
                                     | (CLK__nMSTP_GPIO4_Cfg       <<  8U) | 0x01D4E047UL)

/* System module stop control register 10 */
#define CLK__nMSBC_SMSTPCR10_Cfg     ((CLK__nMSTP_SSIF0_Cfg       << 15U)  \
                                     | (CLK__nMSTP_SSIF1_Cfg       << 14U)  \
                                     | (CLK__nMSTP_DNFA0_Cfg       <<  3U) | 0xFFFE3FE0UL)

/* System module stop control register 11 */
#define CLK__nMSBC_SMSTPCR11_Cfg     ((CLK__nMSTP_DCRA0_Cfg       <<  3U) | 0x1F7UL)

/*Mask for clock output control bit */
#define CLK__nCKSTP_Mask                    (1UL << 8U)
#define CLK__nPIX2CKSTP_Mask                (1UL << 9U)

/* H1H - Structure of Clock Controller Registers */
typedef struct {
   CLK__GAP32(0x0000, 0x0004);
   u32 u32Frqcrb;      /* 0xE615 0004 - Frequency control register B */
   CLK__GAP32(0x0008, 0x0028);
   u32 u32Pll1cr;      /* 0xE615 0028 - PLL1 control register */
   CLK__GAP32(0x002C, 0x0030);
   u32 u32Mstpsr0;     /* 0xE615 0030 - Module stop status register 0 */
   CLK__GAP32(0x0034, 0x0038);
   u32 u32Mstpsr1;     /* 0xE615 0038 - Module stop status register 1 */
   u32 u32Mstpsr5;     /* 0xE615 003C - Module stop status register 5 */
   u32 u32Mstpsr2;     /* 0xE615 0040 - Module stop status register 2 */
   CLK__GAP32(0x0044, 0x0048);
   u32 u32Mstpsr3;     /* 0xE615 0048 - Module stop status register 3 */
   u32 u32Mstpsr4;     /* 0xE615 004C - Module stop status register 4 */
   CLK__GAP32(0x0050, 0x00D0);
   u32 u32Pllecr;      /* 0xE615 00D0 - PLL Enable Control Register */
   CLK__GAP32(0x00D4, 0x00D8);
   u32 u32Pll0cr;      /* 0xE615 00D8 - PLL0 control register */
   u32 u32Pll3cr;      /* 0xE615 00DC - PLL3 control register */  
   CLK__GAP32(0x00E0, 0x0130);
   u32 u32Smstpcr0;    /* 0xE615 0130 - System module stop control register 0 */
   u32 u32Smstpcr1;    /* 0xE615 0134 - System module stop control register 1 */
   u32 u32Smstpcr2;    /* 0xE615 0138 - System module stop control register 2 */
   u32 u32Smstpcr3;    /* 0xE615 013C - System module stop control register 3 */
   u32 u32Smstpcr4;    /* 0xE615 0140 - System module stop control register 4 */
   u32 u32Smstpcr5;    /* 0xE615 0144 - System module stop control register 5 */
   u32 u32Smstpcr6;    /* 0xE615 0148 - System module stop control register 6 */
   u32 u32Smstpcr7;    /* 0xE615 014C - System module stop control register 7 */
   CLK__GAP32(0x0150, 0x01C0);
   u32 u32Mstpsr6;     /* 0xE615 01C0 - Module stop status register 6 */
   u32 u32Mstpsr7;     /* 0xE615 01C4 - Module stop status register 7 */
   CLK__GAP32(0x01C8, 0x01F4);
   u32 u32Pllscr;      /* 0xE615 01F4 - PLLS control register */
   CLK__GAP32(0x01F8, 0x0240);
   u32 u32Mmc0ckcr;    /* 0xE615 0240 - MMC0 clock frequency control register */
   CLK__GAP32(0x0244, 0x0270);
   u32 u32Rcanckcr;    /* 0xE615 0270 - RCAN clock frequency control register */
   CLK__GAP32(0x0274, 0x036C); /* GAP of 62 words */
   u32 u32IntOscEncr;  /* 0xE615 036C - Internal OSC enable control register */
   u32 u32IntOscProc;  /* 0xE615 0370 - Internal OSC protection command register */
   u32 u32IntOscProc2; /* 0xE615 0374 - Internal OSC write protect register 2 */
   CLK__GAP32(0x0378, 0x0990); /* GAP of 390 words */
   u32 u32Smstpcr8;    /* 0xE615 0990 - System module stop control register 8 */
   u32 u32Smstpcr9;    /* 0xE615 0994 - System module stop control register 9 */
   u32 u32Smstpcr10;   /* 0xE615 0998 - System module stop control register 10 */
   u32 u32Smstpcr11;   /* 0xE615 099C - System module stop control register 11 */
   u32 u32Mstpsr8;     /* 0xE615 09A0 - Module stop status register 8 */
   u32 u32Mstpsr9;     /* 0xE615 09A4 - Module stop status register 9 */
   u32 u32Mstpsr10;    /* 0xE615 09A8 - Module stop status register 10 */
   u32 u32Mstpsr11;    /* 0xE615 09AC - Module stop status register 11 */
   CLK__GAP32(0x09B0, 0x0A08);
   u32 u32Tpuclkcr;    /* 0xE615 0A08 - CKSC_TPUCLK_Control Register */
   u32 u32Cmtclkcr;    /* 0xE615 0A0C - CKSC_CMTCLK_Control Register */
   u32 u32Tmuclkcr;    /* 0xE615 0A10 - CKSC_TMUCLK_Control Register */
   u32 u32Sfmaclkcr;   /* 0xE615 0A14 - CKSC_SFMACLK_Control Register */
   CLK__GAP32(0x0A18, 0x0A24);
   u32 u32Z2dclkcr;    /* 0xE615 0A24 - CKSC_Z2DCLK_CTL Register */
   u32 u32Z3dclkcr;    /* 0xE615 0A28 - CKSC_Z3DCLK_CTL Register */
   u32 u32Usbclkcr;    /* 0xE615 0A2C - CKSC_USBCLK_CTL Register */
   CLK__GAP32(0x0A30, 0x0A34);
   u32 u32Pix2aclkcr;  /* 0xE615 0A34 - CKSC_PIX2A_CTL Register */
   u32 u32Pix2bclkcr;  /* 0xE615 0A38 - CKSC_PIX2B_CTL Register */
   u32 u32Pix3aclkcr;  /* 0xE615 0A3C - CKSC_PIX3A_CTL Register */
   u32 u32Pix4aclkcr;  /* 0xE615 0A40 - CKSC_PIX4A_CTL Register */
   u32 u32Cksccr;      /* 0xE615 0A44 - CKSC_CTL Register */
   CLK__GAP32(0x0A48, 0x0A64);
   u32 u32Pix1clkcr;   /* 0xE615 0A64 - CKSC_PIX1_CTL Register */
   u32 u32Pix2clkcr;   /* 0xE615 0A68 - CKSC_PIX2_CTL Register */
   u32 u32Pix3clkcr;   /* 0xE615 0A6C - CKSC_PIX3_CTL Register */
   u32 u32Pix4clkcr;   /* 0xE615 0A70 - CKSC_PIX4_CTL Register */
   CLK__GAP32(0x0A74, 0x0A78);
   u32 u32Pix2dclkcr;  /* 0xE615 0A78 - CKSC_PIX2D_CTL Register */
   CLK__GAP32(0x0A7C, 0x0A80);
   u32 u32Pll0cr1;     /* 0xE615 0A80 - PLL0 control register 1 */
   CLK__GAP32(0x0A84, 0x0A88);
   u32 u32Pllscr1;     /* 0xE615 0A88 - PLLS control register 1 */
   CLK__GAP32(0x0A8C, 0x0A90);
   u32 u32Cksccr2;     /* 0xE615 0A90 - CKSC_Z2CK_CTL Register */
} CLK_tstD1H_ClkCtrl;

/* D1H - Structure of Clock Monitor registers */
typedef struct {
   u8  u8Clmanctl0;    /* 0x00 - CLMAn control register 0 */
   CLK__GAP8(0x0001, 0x0008);
   u16 u16Clmancmpl;    /* 0x08 - CLMAn compare register L */
   CLK__GAP16(0x000A, 0x000C);
   u16 u16Clmancmph;    /* 0x0C - CLMAn compare register H */
   CLK__GAP16(0x000E, 0x0010);
   u8  u8Clmanpcmd;    /* 0x10 - CLMAnCTL0 protection command register */
   CLK__GAP8(0x0011, 0x0014);
   u8  u8Clmanps;      /* 0x14 - CLMAnCTL0 protection status register */
   CLK__GAP8(0x0015, 0x0018);
   u8  u8Clmanemu0;    /* 0x18 - CLMAn emulation register 0 */
} CLK_tstD1H_Clma;


/* Structure of PLLx control register */
typedef union{
   u32 u32word;
   struct
   {
      u32 bi32Reserved0  :  7;
      u32 bi32CKSEL      :  1;
      u32 bi32Reserved1  :  4;
      u32 bi32CKSELPLL0  :  1;
      u32 bi32Reserved2  :  7;
      u32 bi32P          :  2;
      u32 bi32Reserved3  :  2;
      u32 bi32STC        :  7;
      u32 bi32CfgEn      :  1;
   }bits;
} CLK__tunPllCR;


/* D1H - Structure of Phase Lock Loop configuration */
typedef struct {
   u32 u32Pllecr;      /* PLL Enable Control Register */
   CLK__tunPllCR unPll0cr;      /* PLL0 control register */
   CLK__tunPllCR unPll3cr;      /* PLL3 control register */
   u32 u32Pll0cr1;     /* PLL0 control register 1 */
   u32 u32Pllscr1;     /* PLLS control register 1 */
}CLK_tstD1H_PLL_Config;

/* D1H - Structure of Clock Pulse Generator configuration */
typedef struct {
   u32 u32Frqcrb;      /* Frequency control register B */
