#ifndef __ASM_ARCH_D1H_CPU_H_
#define __ASM_ARCH_D1H_CPU_H_

void cpu_init(void);

void cpu_set_qosparams(void);

void cpu_set_media_axi(void);

void cpu_set_cci_axi(void);

void cpu_set_sys_axi(void);

void cpu_set_mxi(void);

void cpu_set_cci400(void);

void cpu_set_s3ctrl(void);

void cpu_qos_dbsc3init(void);

#define CPU__GAP32(start,finish)    u32 u32__##start##_##finish[((finish)-(start))/4]

/***************************************************************************
* S3CTRL Registers
****************************************************************************/
#define CPU__nS3CTRL_BaseAddr           0xE6784000UL

#define CPU__nS3C_QoS_Reg_BaseAddr       (CPU__nS3CTRL_BaseAddr + 0x0014UL)

//#define CPU__nS3C_QoSDCACHE_BaseAddr   (CPU__nS3CTRL_BaseAddr + 0x0BDCUL)
#define CPU__nS3C_QoSCCI0_BaseAddr       (CPU__nS3CTRL_BaseAddr + 0x0C00UL)
#define CPU__nS3C_QoSCCI1_BaseAddr       (CPU__nS3CTRL_BaseAddr + 0x0C24UL)
#define CPU__nS3C_QoSMXI_BaseAddr        (CPU__nS3CTRL_BaseAddr + 0x0C48UL)
#define CPU__nS3C_QoSAXI_BaseAddr        (CPU__nS3CTRL_BaseAddr + 0x0C6CUL)

/***************************************************************************
* DBSC3 Registers
****************************************************************************/
#define CPU__nDBSC3_DEVICE_MAX             16
#define CPU__nDBCS3_0_BaseAddr            0xE6790000UL
/* DBSC3 QoS Read register */
#define CPU__nDBCS3_0_QOS_R0_BaseAddr     (CPU__nDBCS3_0_BaseAddr + 0x1000UL)

#define CPU__nMEDAXI_VCP0CR_THRES0_Cfg   0x00002064UL
#define CPU__nMEDAXI_VCP0CR_THRES1_Cfg   0x00002004UL
#define CPU__nMEDAXI_VCP0CR_THRES2_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0CR_QON_Cfg      0x00000001UL

#define CPU__nMEDAXI_VCP0CW_CONF_Cfg     0x00000001UL
#define CPU__nMEDAXI_VCP0CW_CTSET0_Cfg   0x00002073UL
#define CPU__nMEDAXI_VCP0CW_CTSET1_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0CW_CTSET2_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0CW_CTSET3_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0CW_REQCTR_Cfg   0x00000020UL
#define CPU__nMEDAXI_VCP0CW_THRES0_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0CW_THRES1_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0CW_THRES2_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0CW_QON_Cfg      0x00000001UL

#define CPU__nMEDAXI_VCP0VR_CONF_Cfg     0x00000001UL
#define CPU__nMEDAXI_VCP0VR_CTSET0_Cfg   0x00002073UL
#define CPU__nMEDAXI_VCP0VR_CTSET1_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VR_CTSET2_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VR_CTSET3_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VR_REQCTR_Cfg   0x00000020UL
#define CPU__nMEDAXI_VCP0VR_THRES0_Cfg   0x00002064UL
#define CPU__nMEDAXI_VCP0VR_THRES1_Cfg   0x00002004UL
#define CPU__nMEDAXI_VCP0VR_THRES2_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0VR_QON_Cfg      0x00000001UL

#define CPU__nMEDAXI_VCP0VW_CONF_Cfg     0x00000001UL
#define CPU__nMEDAXI_VCP0VW_CTSET0_Cfg   0x00002073UL
#define CPU__nMEDAXI_VCP0VW_CTSET1_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VW_CTSET2_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VW_CTSET3_Cfg   0x00000000UL
#define CPU__nMEDAXI_VCP0VW_REQCTR_Cfg   0x00000020UL
#define CPU__nMEDAXI_VCP0VW_THRES0_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0VW_THRES1_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0VW_THRES2_Cfg   0x00000001UL
#define CPU__nMEDAXI_VCP0VW_QON_Cfg      0x00000001UL

#define CPU__nMEDAXI_VCP0R_CONF_Cfg      0x00000001UL
#define CPU__nMEDAXI_VCP0R_CTSET0_Cfg    0x00002073UL
#define CPU__nMEDAXI_VCP0R_CTSET1_Cfg    0x00000000UL
#define CPU__nMEDAXI_VCP0R_CTSET2_Cfg    0x00000000UL
#define CPU__nMEDAXI_VCP0R_CTSET3_Cfg    0x00000000UL
#define CPU__nMEDAXI_VCP0R_REQCTR_Cfg    0x00000020UL
#define CPU__nMEDAXI_VCP0R_THRES0_Cfg    0x00002064UL
#define CPU__nMEDAXI_VCP0R_THRES1_Cfg    0x00002004UL
#define CPU__nMEDAXI_VCP0R_THRES2_Cfg    0x00000001UL
#define CPU__nMEDAXI_VCP0R_QON_Cfg       0x00000001UL


/* Reset value of the interrupt controller registers */
#define CPU__nIntRegResetValue           0x00000000UL

/* Configuration for Distributor Control Register, enable the Grp0 and Grp1 */
#define CPU__nGIDC_CTLR_Cfg              0x00000003UL

/* Configuration for CPU Interface Control Register */
#define CPU__nGICC_CTLR_Cfg              0x0000016fUL

#define CPU__nGICD_ICACTIVER_Cfg         0xffffffffUL
#define CPU__nGICD_ICENABLER_Cfg         0xffff0000UL
#define CPU__nGICD_ISENABLER_Cfg         0x0000ffffUL

#define CPU__nVERIFICATION_TIMEOUT     1000

/**
* Description: Struct used to access S3CTRL registers
*/
typedef struct {
    //CPU__GAP32(0x0000, 0x0014); // gap 0x0000 to 0x00014
    u32 u32S3CRORR;         // 0x0014 - S3C Read Outstanding Regulation Register
    u32 u32S3CWORR;         // 0x0018 - S3C Write Outstanding Regulation Register
} CPU__tstS3CTRL_Config;

/**
* Description: Struct used to access MXI(QoS) registers
*/
typedef struct {
    u32 u32S3CQOS0;  // 0x0000
    u32 u32S3CQOS1;  // 0x0004
    u32 u32S3CQOS2;  // 0x0008
    u32 u32S3CQOS3;  // 0x000C
    u32 u32S3CQOS4;  // 0x0010
    u32 u32S3CQOS5;  // 0x0014
    u32 u32S3CQOS6;  // 0x0018
    u32 u32S3CQOS7;  // 0x001C
    u32 u32S3CQOS8;  // 0x0020
}CPU__tstS3C_QOS_Config;

/**
* Description: Struct used to access MXI Base registers
*/
typedef struct {
    u32 u32MXSAAR0;
    u32 u32MXSAAR1;
}CPU__tstMXI_Config;

typedef struct {
    u32 u32MXRTCR;
    u32 u32MXWTCR;
}CPU__tstMXI_CR_Config;

/**
* Description: Struct used to access MXI (QoS) registers
*/
typedef struct {
    u32 u32VSPDU0; 
    u32 u32VSPDU1;
    u32 u32DU0;
    u32 u32DU1;
}CPU__tstMXI_QOS_Config;

/**
* Description: Struct used to access D1H MXIR (QoS) registers
*/
typedef struct {
    /*
    * Only u32VIN is used by Baremetal Loader
    * commented dummy,  Used offset to avoid writing to other addresses
    * Whenever these are enabled need to remove the offset from CPU__nMXIR_QOS_BaseAddr.
    */

    /* u32 u32DUMMY[3]; */
    u32 u32VIN;
}CPU__tstMXIR_QOS_Config;

/* AXI(QoS) */
typedef struct  {
    u32 u32QOSCONF;   /* 0x00 */
    u32 u32QOSCTSET0; /* 0x04 */
    u32 u32QOSCTSET1; /* 0x08 */
    u32 u32QOSCTSET2; /* 0x0C */
    u32 u32QOSCTSET3; /* 0x10 */
    u32 u32QOSREQCTR; /* 0x14 */
    u32 u32QOSTHRES0; /* 0x18 */
    u32 u32QOSTHRES1; /* 0x1C */
    u32 u32QOSTHRES2; /* 0x20 */
    u32 u32QOSQON;    /* 0x24 */
}CPU__tstAXI_Config;
/**
* Description: Struct used to access CCI-400(QoS) registers
*/
typedef struct {
    CPU__GAP32(0x0000, 0x1100); // gap
    u32 u32ARQOS;  //0x1100  Read Channel QoS Value Override Register for slave interface 0.
    u32 u32AWQOS;  //0x1104  Write Channel QoS Value Override slave interface 0.
	CPU__GAP32(0x1108, 0x110C); // gap
    u32 u32QOSCTRL_1;  //0x110C QoS Control Register for slave interface 0.
    u32 u32MAXOT_1;  //0x1110 Max OT Register for slave interface 0.
    CPU__GAP32(0x1114, 0x210C); // gap
	u32 u32QOSCTRL_2;  //0x210C QoS Control Register for slave interface 0.
    u32 u32MAXOT_2;  //0x2110 Max OT Register for slave interface 1.
	CPU__GAP32(0x2114, 0x310C); // gap
	u32 u32QOSCTRL_3;  //0x310C QoS Control Register for slave interface 0.
	u32 u32MAXOT_3;  //0x3110 Max OT Register for slave interface 2.
}CPU__tstCCI400_QoS_Config;

/**
* Description: Struct used to access CCI-400(QoS) registers
*/
typedef struct {
    u32 u32ARQOS;  //Read Channel QoS Value Override Register for slave interface 0.
    u32 u32AWQOS;  //Write Channel QoS Value Override slave interface 0.
}CPU__tstCCI400_QoSOverrideConfig;

typedef struct {
    u32 u32QOSCTRL;  //0x1100  Read Channel QoS Value Override Register for slave interface 0.
    u32 u32MAXOT;  //0x1104  Write Channel QoS Value Override slave interface 0.
}CPU__tstCCI400_QoSCntrlConfig;

/**
* Description: Struct used to access DBSC3_0(QoS) registers
*/
typedef struct {
    u32 u32DBLGCNT;
    u32 u32DBTMVAL0;
    u32 u32DBTMVAL1;
    u32 u32DBTMVAL2;
    u32 u32DBTMVAL3;
    u32 u32DBRQCTR;
    u32 u32DBTHRES0;
    u32 u32DBTHRES1;
    u32 u32DBTHRES2;
    u32 u32DUMMY0;	/* 0x24 */
    u32 u32DBLGQON;
}CPU__tstDBSC3_QOS_Config;

typedef struct{
    CPU__tstDBSC3_QOS_Config stDBSC3_ReadQoSConfig;    /* Configuration of DDR3 DBSC3 QoS Read */
    CPU__tstDBSC3_QOS_Config stDBSC3_WriteQoSConfig;   /* Configuration of DDR3 DBSC3 QoS Write */
}CPU__tstDBSC3_QoSCntrlConfig;

typedef struct{
    CPU__tstAXI_Config stSYSAXI_S64_Config;
    CPU__tstAXI_Config stSYSAXI_AVB_Config;
    CPU__tstAXI_Config stSYSAXI_IMUX0_Config;
    CPU__tstAXI_Config stSYSAXI_IMUX1_Config;
    CPU__tstAXI_Config stSYSAXI_IMUX2_Config;
    CPU__tstAXI_Config stSYSAXI_MMUDS_Config;
    CPU__tstAXI_Config stSYSAXI_MMUM_Config;
    CPU__tstAXI_Config stSYSAXI_MMUS0_Config;
    CPU__tstAXI_Config stSYSAXI_MMUS1_Config;
    CPU__tstAXI_Config stSYSAXI_SDS0_Config;
    CPU__tstAXI_Config stSYSAXI_SDS1_Config;
    CPU__tstAXI_Config stSYSAXI_USB20_Config;
    CPU__tstAXI_Config stSYSAXI_MLB_Config;
    CPU__tstAXI_Config stSYSAXI_AX2M_Config;
