#ifndef __ASM_ARCH_D1H_SDRAM_H__
#define __ASM_ARCH_D1H_SDRAM_H__
#include <asm/types.h>

bool sdram_init(void);

#define SDRAM_GAP32(start,finish)    u32 u32__##start##_##finish[((finish)-(start))/4]

#define SDRAM_nDDR3_1066   1066
#define SDRAM_nDDR3_1333   1333

#define SDRAM_nDDR3_2x4Gb   1
#define SDRAM_nDDR3_2x2Gb   2
#define SDRAM_nDDR3_2x1Gb   3
#define SDRAM_nDDR3_1x4Gb   4
#define SDRAM_nDDR3_1x2Gb   5
#define SDRAM_nDDR3_1x1Gb   6
/*
 * Description: Configuration for DDR3 fallback values
 * Values     : SDRAM_nDDR3_1066 - use DDR3-1066
 *              SDRAM_nDDR3_1333 - use DDR3-1333
 */
#define SDRAM_nDDR3RateConfig   SDRAM_nDDR3_1333

#define SDRAM_nDDR3SizeConfig   SDRAM_nDDR3_2x4Gb

/*
* Memory Test Configuration
* This is used to verify DDR3 Initialization
*/
#define SDRAM__nMemTestDataPattern             0xE11AE11AUL
#define SDRAM__nMemTestStartAddress            0x40000000UL
#define SDRAM__nMemTestAddressIncrement        0x10000000UL
#define SDRAM__nMemTestEndAddress              0xBFFFFFFFUL

/***************************************************************************
* SDRAM TIMING CONFIGURATION
****************************************************************************/
#define SDRAM__nSDRAM_ZQCalibration           On
/*
* Description : Switch to enable periodic ZQ calibration
*  Values      : On | Off
*/

#define SDRAM__nSDRAM_AutoPowerDown           On
/*
* Description : Switch to enable auto-power-down mode
*  Values      : On | Off
*/

/*

* Mask for error flags. Error if bits[31]==0
*/
#define SDRAM__nErrorFlags2_Msk               (0x7FFFFFFFUL)

/*
* DDR3 PHY Address Settings (do not change)
*/
#define SDRAM__nDDR3PHY000_Addr               (0x00000000UL)
#define SDRAM__nDDR3PHY001_Addr               (0x00000001UL)
#define SDRAM__nDDR3PHY002_Addr               (0x00000002UL)
#define SDRAM__nDDR3PHY003_Addr               (0x00000003UL)
#define SDRAM__nDDR3PHY004_Addr               (0x00000004UL)
#define SDRAM__nDDR3PHY005_Addr               (0x00000005UL)
#define SDRAM__nDDR3PHY006_Addr               (0x00000006UL)
#define SDRAM__nDDR3PHY007_Addr               (0x00000007UL)
#define SDRAM__nDDR3PHY008_Addr               (0x00000008UL)
#define SDRAM__nDDR3PHY020_Addr               (0x00000020UL)
#define SDRAM__nDDR3PHY021_Addr               (0x00000021UL)
#define SDRAM__nDDR3PHY022_Addr               (0x00000022UL)
#define SDRAM__nDDR3PHY023_Addr               (0x00000023UL)
#define SDRAM__nDDR3PHY024_Addr               (0x00000024UL)
#define SDRAM__nDDR3PHY025_Addr               (0x00000025UL)
#define SDRAM__nDDR3PHY026_Addr               (0x00000026UL)
#define SDRAM__nDDR3PHY027_Addr               (0x00000027UL)
#define SDRAM__nDDR3PHY028_Addr               (0x00000028UL)
#define SDRAM__nDDR3PHY029_Addr               (0x00000029UL)
#define SDRAM__nDDR3PHY02C_Addr               (0x0000002CUL)
#define SDRAM__nDDR3PHY090_Addr               (0x00000090UL)
#define SDRAM__nDDR3PHY091_Addr               (0x00000091UL)
#define SDRAM__nDDR3PHY095_Addr               (0x00000095UL)
#define SDRAM__nDDR3PHY099_Addr               (0x00000099UL)
#define SDRAM__nDDR3PHY0A0_Addr               (0x000000A0UL)
#define SDRAM__nDDR3PHY0A3_Addr               (0x000000A3UL)
#define SDRAM__nDDR3PHY0A7_Addr               (0x000000A7UL)
#define SDRAM__nDDR3PHY0A8_Addr               (0x000000A8UL)
#define SDRAM__nDDR3PHY0A9_Addr               (0x000000A9UL)
#define SDRAM__nDDR3PHY0C0_Addr               (0x000000C0UL)
#define SDRAM__nDDR3PHY0C3_Addr               (0x000000C3UL)
#define SDRAM__nDDR3PHY0C7_Addr               (0x000000C7UL)
#define SDRAM__nDDR3PHY0C8_Addr               (0x000000C8UL)
#define SDRAM__nDDR3PHY0C9_Addr               (0x000000C9UL)
#define SDRAM__nDDR3PHY0E0_Addr               (0x000000E0UL)
#define SDRAM__nDDR3PHY0E1_Addr               (0x000000E1UL)
#define SDRAM__nDDR3PHY0E3_Addr               (0x000000E3UL)
#define SDRAM__nDDR3PHY0E7_Addr               (0x000000E7UL)
#define SDRAM__nDDR3PHY0E8_Addr               (0x000000E8UL)
#define SDRAM__nDDR3PHY0E9_Addr               (0x000000E9UL)
#define SDRAM__nDDR3PHY100_Addr               (0x00000100UL)
#define SDRAM__nDDR3PHY101_Addr               (0x00000101UL)
#define SDRAM__nDDR3PHY103_Addr               (0x00000103UL)
#define SDRAM__nDDR3PHY107_Addr               (0x00000107UL)
#define SDRAM__nDDR3PHY108_Addr               (0x00000108UL)
#define SDRAM__nDDR3PHY109_Addr               (0x00000109UL)
/**
* Description: Struct to store calibration information`
*/
typedef struct {
   u32 u32DBTR3;
   u32 u32DBTR4;
   u32 u32DBTR5;
   u32 u32DBTR6;
   u32 u32DBTR7;
   u32 u32DBTR8;
   u32 u32DBTR9;
   u32 u32DBTR10;
   u32 u32DBTR11;
   u32 u32DBTR12;
   u32 u32DBTR13;
   u32 u32DBTR14;
   u32 u32DBTR15;
   u32 u32DBTR16;
   u32 u32DBTR17;
   u32 u32DBTR18;
   u32 u32DBTR19;
} SDRAM_tstTimingCfg;

typedef struct {
   u32 u32DBRFCNF0;
   u32 u32DBRFCNF1;
   u32 u32DBRFCNF2;
} SDRAM_tstRefreshCfg;

/** 
* Description: Struct used to access DBSC3 registers
*/
typedef struct {
   u32 u32DBACEN;       // 0x0010 - SDRAM access enable register
   u32 u32DBRFEN;       // 0x0014 - Auto-refresh enable register
   u32 u32DBCMD;        // 0x0018 - Manual command-issuing register
   u32 u32DBWAIT;       // 0x001C - Operation completion waiting register
   u32 u32DBKIND;       // 0x0020 - SDRAM type setting register
   u32 u32DBCONF0;      // 0x0024 - SDRAM configuration setting register 0
   SDRAM_GAP32(0x0028, 0x0030);
   u32 u32DBPHYTYPE;    // 0x0030 - PHY type setting register
   SDRAM_GAP32(0x0034, 0x0040);
   u32 u32DBTR0;        // 0x0040 - SDRAM timing register 0
   u32 u32DBTR1;        // 0x0044 - SDRAM timing register 1
   SDRAM_GAP32(0x0048, 0x0050);
   SDRAM_tstTimingCfg stTimingReg;
/* u32 u32DBTR3;        // 0x0050 - SDRAM timing register 3
   u32 u32DBTR4;        // 0x0054 - SDRAM timing register 4
   u32 u32DBTR5;        // 0x0058 - SDRAM timing register 5
   u32 u32DBTR6;        // 0x005C - SDRAM timing register 6
   u32 u32DBTR7;        // 0x0060 - SDRAM timing register 7
   u32 u32DBTR8;        // 0x0064 - SDRAM timing register 8
   u32 u32DBTR9;        // 0x0068 - SDRAM timing register 9
   u32 u32DBTR10;       // 0x006C - SDRAM timing register 10
   u32 u32DBTR11;       // 0x0070 - SDRAM timing register 11
   u32 u32DBTR12;       // 0x0074 - SDRAM timing register 12
   u32 u32DBTR13;       // 0x0078 - SDRAM timing register 13
   u32 u32DBTR14;       // 0x007C - SDRAM timing register 14
   u32 u32DBTR15;       // 0x0080 - SDRAM timing register 15
   u32 u32DBTR16;       // 0x0084 - SDRAM timing register 16
   u32 u32DBTR17;       // 0x0088 - SDRAM timing register 17
   u32 u32DBTR18;       // 0x008C - SDRAM timing register 18
   u32 u32DBTR19;       // 0x0090 - SDRAM timing register 19 */
   SDRAM_GAP32(0x0094, 0x00C0);
   u32 u32DBADJ0;       // 0x00C0 - DBSC3 operation adjustment register 0
   SDRAM_GAP32(0x00C4, 0x00C8);
   u32 u32DBADJ2;       // 0x00C8 - DBSC3 operation adjustment register 2
   SDRAM_GAP32(0x00CC, 0x00E0);
   SDRAM_tstRefreshCfg stRefreshReg;
/* u32 u32DBRFCNF0;     // 0x00E0 - Refresh configuration register 0
   u32 u32DBRFCNF1;     // 0x00E4 - Refresh configuration register 1
   u32 u32DBRFCNF2;     // 0x00E8 - Refresh configuration register 2 */
   SDRAM_GAP32(0x00EC, 0x00F4);
   u32 u32DBCALCNF;     // 0x00F4 - DDR3-SDRAM calibration configuration register
   u32 u32DBCALTR;      // 0x00F8 - DDR3-SDRAM calibration timing register
   SDRAM_GAP32(0x00FC, 0x0100);
   u32 u32DBRNK0;       // 0x0100 - ODT operation setting register
   SDRAM_GAP32(0x0104, 0x0180);
   u32 u32DBPDNCNF;     // 0x0180 - Power-down configuration register
   SDRAM_GAP32(0x0184, 0x0200);
   u32 u32DBPDCNT0;     // 0x0200 - PHY Control Register 0
   SDRAM_GAP32(0x0204, 0x0240);
   u32 u32DBDFISTAT;    // 0x0240 - DFI status IF input register
   u32 u32DBDFICNT;     // 0x0244 - DFI status IF output register
   SDRAM_GAP32(0x0248, 0x0280);
   u32 u32DBPDLCK;      // 0x0280 - PHY unit lock register
   SDRAM_GAP32(0x0284, 0x0290);
   u32 u32DBPDRGA;      // 0x0290 - PHY unit address register
   SDRAM_GAP32(0x0294, 0x02A0);
   u32 u32DBPDRGD;      // 0x02A0 - PHY unit access register
   SDRAM_GAP32(0x02A4, 0x0304);
   u32 u32DBBS0CNT1;    // 0x0304 - Bus control unit 0 control register 1
   SDRAM_GAP32(0x0308, 0x0380);
   u32 u32DBWT0CNF0;    // 0x0380 - AXI port setting register 0
   SDRAM_GAP32(0x0384, 0x0390);
   u32 u32DBWT0CNF4;    // 0x0390 - AXI port setting register 4
   SDRAM_GAP32(0x0394, 0x0500);
   u32 u32DBSCHECNT0;   // 0x0500 - Scheduler setting register 0
   SDRAM_GAP32(0x0504, 0x4000);
   u32 u32DBRSTLCK;     // 0x4000 - DBSC Reset Lock register
   SDRAM_GAP32(0x4004, 0x4008);
   u32 u32DBRST;        // 0x4008 - DBSC Reset register

} * SDRAM__tpstDBSC3Reg;

typedef struct {
   uint32 u32DBTR0;  // SDRAM Timing Register 0
   uint32 u32DBTR1;
   /* u32DBTR2 does not exist */
   SDRAM_tstTimingCfg stTimingCfg;
   uint32 u32DBCONF0;
   uint32 u32DBRNK0;
   uint32 u32DBADJ0;
   uint32 u32DBADJ2;
   uint32 u32DBWT0CNF0;
   uint32 u32DBCALTR;
   SDRAM_tstRefreshCfg stRefreshCfg;
   uint32 u32DBRFEN;
} SDRAM_tstTimingConfig;

/* Struct of DDR3 PHY settings */
typedef struct {
   uint32 u32Phy0003A;
   uint32 u32Phy0003B;
   uint32 u32Phy0004;
   uint32 u32Phy0008;
   uint32 u32Phy0020;
   uint32 u32Phy0022;
   uint32 u32Phy0023;
   uint32 u32Phy0024;
   uint32 u32Phy0025;
   uint32 u32Phy0026;
   uint32 u32Phy0027;
   uint32 u32Phy0028;
   uint32 u32Phy0029;
   uint32 u32Phy0091;
   uint32 u32Phy0099;
} SDRAM_tstPhyConfig;

#endif /* __ASM_ARCH_D1H_SDRAM_H__ */
